Repository: hadealahmad/anonymous-messages
Catalog: languages/anonymous-messages-*.po
Languages: ar

source: Anonymous Messages
ar: الرسائل المجهولة

source: A WordPress plugin that allows site visitors to send anonymous messages through a Gutenberg block with spam protection and admin management.
ar: إضافة ووردبريس تسمح لزوار الموقع بإرسال رسائل مجهولة من خلال كتلة جوتنبرغ مع حماية من البريد المزعج وإدارة شاملة.

source: Hadi Alahmad
ar: هادي الأحمد

source: Anonymous Answers
ar: الإجابات المجهولة

source: Anonymous Answer
ar: إجابة مجهولة

source: Add New
ar: إضافة جديد

source: Add New %s
ar: إضافة %s جديد

source: Edit %s
ar: تعديل %s

source: New %s
ar: %s جديد

source: View %s
ar: عرض %s

source: Search %s
ar: بحث في %s

source: No %s found
ar: لم يتم العثور على %s.

source: No %s found in trash
ar: لم يتم العثور على %s في سلة المهملات

source: All %s
ar: جميع %s

source: %s Archives
ar: أرشيف %s

source: %s Attributes
ar: خصائص %s

source: Insert into %s
ar: إدراج في %s

source: Uploaded to this %s
ar: رُفع إلى هذا %s

source: Messages
ar: الرسائل

source: Categories
ar: التصنيفات

source: Settings
ar: الإعدادات

source: Are you sure you want to delete this message?
ar: هل أنت متأكد من حذف هذه الرسالة؟

source: Are you sure you want to delete this category?
ar: هل أنت متأكد من حذف هذا التصنيف؟

source: Success!
ar: نجاح!

source: Error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.

source: Loading...
ar: جاري التحميل...

source: Asked
ar: سُئل

source: Answered
ar: أُجيب

source: Share on Twitter
ar: مشاركة على تويتر

# Question prefix for Twitter sharing
source: q:
ar: س:

# Answer prefix for Twitter sharing
source: a:
ar: ج:

source: Please enter a response.
ar: يرجى إدخال رد.

source: Please select a post.
ar: يرجى تحديد منشور.

source: Submitting...
ar: جاري الإرسال...

source: Category name is required.
ar: اسم التصنيف مطلوب.

source: Show full answer
ar: عرض الإجابة كاملة

source: Hide full answer
ar: إخفاء الإجابة كاملة

source: Settings saved successfully!
ar: تم حفظ الإعدادات بنجاح!

source: Unauthorized
ar: غير مصرح

source: Invalid message ID
ar: معرف الرسالة غير صالح

source: Short response cannot be empty
ar: لا يمكن أن يكون الرد القصير فارغاً

source: Invalid post ID
ar: معرف المنشور غير صالح

source: Response added successfully!
ar: تم إضافة الرد بنجاح!

source: Failed to add response
ar: فشل في إضافة الرد.

source: Invalid response ID
ar: معرف الرد غير صالح

source: Response updated successfully!
ar: تم تحديث الرد بنجاح!

source: Failed to update response
ar: فشل في تحديث الرد.

source: Invalid parameters
ar: معاملات غير صالحة

source: Status updated successfully!
ar: تم تحديث الحالة بنجاح!

source: Failed to update status
ar: فشل في تحديث الحالة.

source: Message deleted successfully!
ar: تم حذف الرسالة بنجاح!

source: Failed to delete message
ar: فشل في حذف الرسالة.

source: Category name is required
ar: اسم التصنيف مطلوب

source: Category created successfully!
ar: تم إنشاء التصنيف بنجاح!

source: Failed to create category
ar: فشل في إنشاء التصنيف.

source: Invalid category ID
ar: معرف التصنيف غير صالح

source: Category deleted successfully!
ar: تم حذف التصنيف بنجاح!

source: Failed to delete category
ar: فشل في حذف التصنيف.

source: Message not found
ar: لم يتم العثور على الرسالة

source: You do not have permission to export messages.
ar: ليس لديك إذن لتصدير الرسائل.

source: Security check failed. Please try again.
ar: فشل فحص الأمان. يرجى المحاولة مرة أخرى.

source: No messages found to export. Please adjust your filters or check if there are any messages available.
ar: لم يتم العثور على رسائل للتصدير. يرجى تعديل المرشحات أو التحقق من وجود رسائل متاحة.

source: ID
ar: المعرف

source: Sender Name
ar: اسم المرسل

source: Message
ar: الرسالة

source: Category
ar: التصنيف

source: Status
ar: الحالة

source: Response Type
ar: نوع الرد

source: Response
ar: الرد

source: Created Date
ar: تاريخ الإنشاء

source: Updated Date
ar: تاريخ التحديث

source: Uncategorized
ar: غير مصنف

source: No Response
ar: لا يوجد رد

source: Export failed. Please try again or contact support if the problem persists.
ar: فشل التصدير. يرجى المحاولة مرة أخرى أو الاتصال بالدعم إذا استمرت المشكلة.

source: Invalid category
ar: تصنيف غير صالح

source: Category updated successfully!
ar: تم تحديث التصنيف بنجاح!

source: Failed to update category
ar: فشل في تحديث التصنيف.

source: Post type settings updated! The changes are now active.
ar: تم تحديث إعدادات نوع المنشور! التغييرات نشطة الآن.

source: anon. msg.
ar: رسالة مجهولة.

source: %d pending anonymous message
ar: %d رسالة مجهولة معلقة

source: Security verification failed. Please refresh the page and try again.
ar: فشل التحقق الأمني. يرجى تحديث الصفحة والمحاولة مرة أخرى.

source: Please wait before sending another message.
ar: يرجى الانتظار قبل إرسال رسالة أخرى.

source: Please enter a message.
ar: يرجى إدخال رسالة.

source: Message must be at least 10 characters long.
ar: يجب أن تكون الرسالة 10 أحرف على الأقل.

source: Message is too long. Please keep it under 2000 characters.
ar: الرسالة طويلة جداً. يرجى إبقاؤها أقل من 2000 حرف.

source: reCAPTCHA verification failed. Please try again.
ar: فشل التحقق من reCAPTCHA. يرجى المحاولة مرة أخرى.

source: Your message contains inappropriate content. Please modify your message and try again.
ar: تحتوي رسالتك على محتوى غير مناسب. يرجى تعديل رسالتك والمحاولة مرة أخرى.

source: Thank you! Your message has been submitted successfully.
ar: شكراً لك! تم إرسال رسالتك بنجاح.

source: Note: Some images could not be uploaded.
ar: ملاحظة: تعذر تحميل بعض الصور.

source: Failed to save your message. Please try again.
ar: فشل في حفظ رسالتك. يرجى المحاولة مرة أخرى.

source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.

source: Security verification failed.
ar: فشل التحقق الأمني.

source: Failed to load questions. Please try again.
ar: فشل في تحميل الأسئلة. يرجى المحاولة مرة أخرى.

source: New Anonymous Message Received - [%s]
ar: تم استلام رسالة مجهولة جديدة - [%s]

source: You have received a new anonymous message.
ar: لقد تلقيت رسالة مجهولة جديدة.

source: View and respond to pending messages
ar: عرض والرد على الرسائل المعلقة

source: A new anonymous message has been submitted to your website.
ar: تم إرسال رسالة مجهولة جديدة إلى موقعك.

source: Too many files. Maximum %d allowed.
ar: عدد الملفات كبير جداً. الحد الأقصى %d مسموح.

source: Upload error for %s.
ar: خطأ في تحميل %s.

source: File %s is too large. Maximum size: %.1fMB
ar: الملف %s كبير جداً. الحد الأقصى للحجم: %.1f ميجا بايت

source: File %s has invalid type.
ar: الملف %s من نوع غير صالح.

source: Failed to save attachment info for %s.
ar: فشل في حفظ معلومات المرفق لـ %s.

source: Failed to upload %s.
ar: فشل في تحميل %s.

source: Show category filter for answered questions (categories are admin-assigned only)
ar: عرض مرشح التصنيفات للأسئلة المجابة (التصنيفات يحددها المشرف فقط)

source: Show the section with answered questions below the form
ar: عرض قسم الأسئلة المجابة أسفل النموذج

source: Number of questions to show per page in the answered questions list
ar: عدد الأسئلة التي تظهر في كل صفحة في قائمة الأسئلة المجابة

source: Enable Google reCAPTCHA v3 spam protection
ar: تفعيل حماية reCAPTCHA v3 من جوجل للرسائل المزعجة

source: Ask your anonymous question here...
ar: اسأل سؤالك المجهول هنا...

source: Custom placeholder text for the message input field
ar: نص عنصر نائب مخصص لحقل إدخال الرسالة

source: Assign messages from this block to a specific user
ar: تعيين رسائل هذه الكتلة لمستخدم محدد

source: Send an email notification to the assigned user or admin for new messages
ar: إرسال إشعار بريد إلكتروني للمستخدم المعين أو المشرف عند وصول رسائل جديدة

source: Allow image uploads with messages (can override global setting)
ar: السماح برفع الصور مع الرسائل (يمكن تجاوز الإعداد العام)

source: Your message has been submitted successfully!
ar: تم إرسال رسالتك بنجاح!

source: There was an error submitting your message. Please try again.
ar: حدث خطأ في إرسال رسالتك. يرجى المحاولة مرة أخرى.

source: Please wait %d seconds before sending another message.
ar: يرجى الانتظار %d ثانية قبل إرسال رسالة أخرى.

source: Load More Questions
ar: تحميل المزيد من الأسئلة

source: No answered questions yet.
ar: لا توجد أسئلة مجابة بعد.

source: All Categories
ar: جميع التصنيفات

source: Answer:
ar: الإجابة:

source: Share
ar: مشاركة

source: Maximum %d images allowed.
ar: بحد أقصى %d صور مسموحة.

source: File "%s" is too large. Maximum size: %sMB
ar: الملف "%s" كبير جداً. الحجم الأقصى: %s ميجا بايت

source: File "%s" is not a valid image.
ar: الملف "%s" ليس صورة صالحة.

source: Remove image
ar: إزالة الصورة

source: Direct access to this file is not allowed.
ar: الوصول المباشر إلى هذا الملف غير مسموح.

source: Message Categories
ar: تصنيفات الرسائل

source: Add New Category
ar: إضافة تصنيف جديد

source: Category Name
ar: اسم التصنيف

source: The name of the category as it will appear to users
ar: اسم التصنيف كما سيظهر للمستخدمين

source: Description
ar: الوصف

source: Optional description for this category
ar: وصف اختياري لهذا التصنيف

source: Add Category
ar: إضافة التصنيف

source: Existing Categories
ar: التصنيفات الموجودة

source: No categories created yet.
ar: لم يتم إنشاء أي تصنيفات بعد.

source: Name
ar: الاسم

source: Slug
ar: المعرف اللطيف

source: Actions
ar: الإجراءات

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Cannot delete (has messages)
ar: لا يمكن الحذف (يحتوي على رسائل)

source: Edit Category
ar: تعديل التصنيف

source: Category Name:
ar: اسم التصنيف:

source: Description:
ar: الوصف:

source: Save Changes
ar: حفظ التغييرات

source: Cancel
ar: إلغاء

source: Pending (%d)
ar: معلقة (%d)

source: Answered (%d)
ar: تم الرد (%d)

source: Featured (%d)
ar: مميزة (%d)

source: Search messages...
ar: البحث عن رسائل...

source: All Users
ar: جميع المستخدمين

source: Filter
ar: تصفية

source: Clear Filters
ar: مسح المرشحات

source: Export:
ar: تصدير:

source: Showing %d of %d pending messages
ar: عرض %d من أصل %d رسالة معلقة

source: Showing %d of %d answered messages
ar: عرض %d من أصل %d رسالة تم الرد عليها

source: Showing %d of %d featured messages
ar: عرض %d من أصل %d رسالة مميزة

source: matching "%s"
ar: مطابقة لـ "%s"

source: Sender
ar: المرسل

source: Date
ar: التاريخ

source: No messages found.
ar: لم يتم العثور على رسائل.

source: Featured
ar: مميزة

source: Show full message
ar: عرض الرسالة كاملة

source: Attached Images:
ar: الصور المرفقة:

source: No Category
ar: لا يوجد تصنيف

source: Respond
ar: رد

source: Pending
ar: معلقة

source: Edit Answer
ar: تعديل الإجابة

source: Respond to Message
ar: الرد على الرسالة

source: Close
ar: إغلاق

source: Original Message
ar: الرسالة الأصلية

source: Rich Text Answer
ar: إجابة نصية منسقة

source: Link to Post
ar: رابط إلى منشور

source: Your Answer
ar: إجابتك

source: Select Post
ar: اختر منشور

source: Select a post...
ar: اختر منشوراً...

source: Link this message to an existing post instead of providing a text answer.
ar: ربط هذه الرسالة بمنشور موجود بدلاً من تقديم إجابة نصية.

source: Send Response
ar: إرسال الرد

source: Update Answer
ar: تحديث الإجابة

source: Hide full message
ar: إخفاء الرسالة كاملة

source: Anonymous Messages Settings
ar: إعدادات الرسائل المجهولة

source: reCAPTCHA v3 Settings
ar: إعدادات reCAPTCHA v3

source: Get your reCAPTCHA keys from <a href="%s" target="_blank">Google reCAPTCHA</a>
ar: احصل على مفاتيح reCAPTCHA من <a href="%s" target="_blank">جوجل reCAPTCHA</a>

source: Site Key
ar: مفتاح الموقع

source: The site key for reCAPTCHA v3
ar: مفتاح الموقع لـ reCAPTCHA v3

source: Secret Key
ar: المفتاح السري

source: The secret key for reCAPTCHA v3 (keep this private)
ar: المفتاح السري لـ reCAPTCHA v3 (احتفظ بهذا سريًا)

source: Rate Limiting
ar: تحديد المعدل

source: Enable Rate Limiting
ar: تفعيل تحديد المعدل

source: Enable rate limiting for message submissions
ar: تفعيل تحديد معدل إرسال الرسائل

source: When disabled, users can submit messages without any time restrictions
ar: عند التعطيل، يمكن للمستخدمين إرسال الرسائل دون أي قيود زمنية

source: Apply to Logged-in Users
ar: تطبيق على المستخدمين المسجلين

source: Apply rate limiting to logged-in users
ar: تطبيق تحديد المعدل على المستخدمين المسجلين

source: When unchecked, logged-in users can submit messages without rate limiting
ar: عند إلغاء التحديد، يمكن للمستخدمين المسجلين إرسال الرسائل دون تحديد معدل

source: Rate Limit (seconds)
ar: تحديد المعدل (ثانية)

source: How long users must wait between message submissions (minimum 30 seconds)
ar: كم من الوقت يجب على المستخدمين الانتظار بين إرسال الرسائل (30 ثانية كحد أدنى)

source: Display Settings
ar: إعدادات العرض

source: Messages Per Page
ar: الرسائل لكل صفحة

source: Number of answered questions to show per page on frontend
ar: عدد الأسئلة المجابة التي تظهر في كل صفحة في الواجهة الأمامية

source: Post Answer Settings
ar: إعدادات إجابة المنشور

source: Post Answer Mode
ar: وضع إجابة المنشور

source: Use Existing Post Type
ar: استخدام نوع المنشور الحالي

source: Create Custom Post Type
ar: إنشاء نوع منشور مخصص

source: Disable Post Answers
ar: تعطيل إجابات المنشورات

source: Choose how post answers should be handled
ar: اختر كيفية التعامل مع إجابات المنشورات

source: Answer Post Type
ar: نوع منشور الإجابة

source: Select which post type to use for post answers
ar: اختر نوع المنشور المراد استخدامه لإجابات المنشورات

source: Custom Post Type Details
ar: تفاصيل نوع المنشور المخصص

source: Post Type:
ar: نوع المنشور:

source: Display Name:
ar: اسم العرض:

source: A custom post type will be automatically created for anonymous message responses.
ar: سيتم إنشاء نوع منشور مخصص تلقائياً لردود الرسائل المجهولة.

source: Twitter Share Settings
ar: إعدادات مشاركة تويتر

source: Customize the Twitter sharing functionality for your questions and answers.
ar: تخصيص وظائف مشاركة تويتر للأسئلة والأجوبة.

source: Default Hashtag
ar: الوسم الافتراضي

source: The hashtag to include with shared tweets (without the # symbol)
ar: الوسم المراد تضمينه مع التغريدات المشتركة (بدون رمز #)

source: Image Upload Settings
ar: إعدادات رفع الصور

source: Enable Image Uploads
ar: تفعيل رفع الصور

source: Allow visitors to attach images to their messages
ar: السماح للزوار بإرفاق صور برسائلهم

source: When enabled, visitors can upload images with their questions. Gutenberg blocks can still disable this individually.
ar: عند التفعيل، يمكن للزوار رفع الصور مع أسئلتهم. يمكن لـ كتل جوتنبرغ تعطيل هذا بشكل فردي.

source: Maximum Image Size (MB)
ar: الحد الأقصى لحجم الصورة (ميجا بايت)

source: Maximum file size allowed per image in megabytes
ar: الحد الأقصى لحجم الملف المسموح لكل صورة بالميجا بايت

source: Maximum Images per Message
ar: الحد الأقصى للصور لكل رسالة

source: Maximum number of images allowed per message
ar: العدد الأقصى للصور المسموحة لكل رسالة

source: Allowed Image Types
ar: أنواع الصور المسموحة

source: Select which image file types are allowed for upload
ar: اختر أنواع ملفات الصور المسموح رفعها

source: Plugin Information
ar: معلومات الإضافة

source: Plugin Version:
ar: إصدار الإضافة:

source: WordPress Version:
ar: إصدار ووردبريس:

source: PHP Version:
ar: إصدار PHP:

source: Session Support:
ar: دعم الجلسات:

source: Active
ar: نشط

source: Not Available
ar: غير متوفر

source: Database Tables:
ar: جداول قاعدة البيانات:

source: All tables exist
ar: جميع الجداول موجودة

source: Some tables missing
ar: بعض الجداول مفقودة

source: Save Settings
ar: حفظ الإعدادات

source: Your Message
ar: رسالتك

source: Your message will be sent anonymously. No personal information is collected.
ar: سيتم إرسال رسالتك بشكل مجهول. لن يتم جمع أي معلومات شخصية.

source: Attach Images (Optional)
ar: إرفاق الصور (اختياري)

source: Choose Images
ar: اختر الصور

source: Max %d images, %s MB each. Allowed: %s
ar: بحد أقصى %d صور، %s ميجا بايت لكل صورة. مسموح: %s

source: Send Message
ar: إرسال الرسالة

source: Please wait %s seconds before sending another message.
ar: يرجى الانتظار %s ثانية قبل إرسال رسالة أخرى.

source: Previously Answered Questions
ar: الأسئلة المجاب عليها سابقاً

source: Search questions and answers:
ar: البحث في الأسئلة والأجوبة:

source: Type to search...
ar: اكتب للبحث...

source: Filter by Category:
ar: تصفية حسب التصنيف:

source: Loading questions...
ar: جاري تحميل الأسئلة...

source: No answered questions yet. Be the first to ask!
ar: لا توجد أسئلة مجابة بعد. كن أول من يسأل!

source: JavaScript is required for the Anonymous Messages block to function properly. Please enable JavaScript in your browser.
ar: جافا سكريبت مطلوب لكتلة الرسائل المجهولة لتعمل بشكل صحيح. يرجى تفعيل جافا سكريبت في متصفحك.

source: A block for collecting anonymous messages from visitors
ar: كتلة لجمع الرسائل المجهولة من الزوار

source: anonymous
ar: مجهول

source: messages
ar: رسائل

source: questions
ar: أسئلة

source: contact
ar: اتصال

source: Show Categories Filter (for answered questions)
ar: عرض مرشح التصنيفات (للأسئلة المجاب عليها)

source: Categories are assigned by admin only. This option controls filtering of answered questions.
ar: التصنيفات يحددها المشرف فقط. يتحكم هذا الخيار في تصفية الأسئلة المجاب عليها.

source: Show Answered Questions
ar: عرض الأسئلة المجاب عليها

source: Questions Per Page
ar: الأسئلة لكل صفحة

source: Form Settings
ar: إعدادات النموذج

source: Enable reCAPTCHA
ar: تفعيل reCAPTCHA

source: Requires reCAPTCHA keys to be configured in plugin settings
ar: يتطلب تكوين مفاتيح reCAPTCHA في إعدادات الإضافة

source: Message Placeholder Text
ar: نص العنصر النائب للرسالة

source: Allow visitors to attach images to their messages. Can override global setting.
ar: السماح للزوار بإرفاق صور مع رسائلهم. يمكن تجاوز الإعداد العام.

source: Assigned User (Messages will be sent to this user)
ar: المستخدم المعين (ستُرسل الرسائل إلى هذا المستخدم)

source: No specific user (Admin only)
ar: لا يوجد مستخدم محدد (المشرف فقط)

source: If no user is selected, only administrators can view the messages.
ar: إذا لم يتم تحديد مستخدم، فقط المشرفون يمكنهم عرض الرسائل.

source: Send Email Notification
ar: إرسال إشعار بريد إلكتروني

source: If enabled, the assigned user will receive an email for each new submission.
ar: إذا تم التمكين، سيتلقى المستخدم المعين رسالة بريد إلكتروني لكل إرسال جديد.

source: If enabled, the site administrator will receive an email for each new submission.
ar: إذا تم التمكين، سيتلقى مدير الموقع رسالة بريد إلكتروني لكل إرسال جديد.

source: Anonymous Messages Block
ar: كتلة الرسائل المجهولة

source: Preview of how the block will appear on the frontend
ar: معاينة لكيفية ظهور الكتلة في الواجهة الأمامية

source: General
ar: عام

source: Technical
ar: تقني

source: ⚡ reCAPTCHA protection enabled
ar: ⚡ تم تفعيل حماية reCAPTCHA

source: Curious Fox 123:
ar: الثعلب الفضولي 123:

source: This is a sample question that has been answered...
ar: هذا سؤال نموذجي تم الرد عليه...

source: This is a sample answer to the question.
ar: هذه إجابة نموذجية على السؤال.

source: Showing %d questions per page
ar: عرض %d أسئلة لكل صفحة
